app/controllers/registrations_controller.rb

	def create
	    	#complete this method
	    	@user = User.new(r_params)
		if @user.save
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "created_at", "updated_at", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?, ?)